Tekla.Structures.Catalogs.ProfileItem.aProfileItemCrossSections
An array list with the profile item cross-sections.

Tekla.Structures.Catalogs.ProfileItem.ProfileItemCrossSections
The list of profile item cross-sections.

Tekla.Structures.Catalogs.ProfileItem.IsCLBProfile
Whether the profile is a clb profile.

Tekla.Structures.Catalogs.ProfileItem.IsHardcodedProfile
Whether the profile is a parametric user-defined hard coded profile.

Tekla.Structures.Catalogs.ProfileItem.SelectCrossSections
Selects the profile item cross section in the profile database.
Returns: True on success.

Tekla.Structures.Catalogs.ProfileItem.AddCrossSection(System.Int32,System.Double,System.Int32,System.Int32)
Adds the cross section to a profile.
CrossSectionNumber: The cross section number.
Location: The Location value.
Type: The type number.
SubType: The subtype number.

Tekla.Structures.Catalogs.ProfileItem.ModifyCrossSection(System.Int32,System.Double,System.Int32,System.Int32)
Modifies the cross section of a profile.
CrossSectionNumber: The cross section number.
Location: The Location value.
Type: The type number.
SubType: The subtype number.

Tekla.Structures.Catalogs.ProfileItem.DeleteCrossSection(System.Int32)
Deletes the cross section of a profile.
CrossSectionNumber: The cross section number.

Tekla.Structures.Catalogs.ProfileItem.SetEquivalentType(System.Int32,System.Int32)
Sets the equivalent type for the specified cross section.
CrossSectionNumber: The cross section number.
EquivalentType: The equivalent type.

Tekla.Structures.Catalogs.ProfileItem.GetProfileItemSubTypes
Selects the profile item and updates the sub types in the profile database.
Returns:

Tekla.Structures.Catalogs.ProfileItem.GetProfileItemSubTypes(Tekla.Structures.Catalogs.ProfileItem,Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum)
profileItem:
typeEnum:
Returns: